7111.0/constant/turbulenceProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object turbulenceProperties;
}

simulationType RAS;

RAS
{
  RASModel kOmegaSST;
  turbulence yes;
  printCoeffs yes;
} 	// ************************************************************************* //

