7111.0/constant/dynamicMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object dynamicMeshDict;
}

motionSolverLibs
  (
    "libfvMotionSolvers.so"
  );

dynamicFvMesh dynamicOversetFvMesh; 	//solver          displacementLaplacian;//displacementLaplacianCoeffs//{//    diffusivity     uniform 1;//}

dynamicOversetFvMeshCoeffs
{
} 	//    layerRelax 0.3;

solver multiSolidBodyMotionSolver;

multiSolidBodyMotionSolverCoeffs
{
  movingZone
  {
    solidBodyMotionFunction oscillatingRotatingMotion;
    oscillatingRotatingMotionCoeffs
    {
      origin (0 0 0);
      axis (0 0 1);
      omega 24.0;
      amplitude (0 0 -4.92);
    }
  }
} 	// ************************************************************************* //

