7111.0/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (59.4161 8.35039 0);

boundaryField
{
  inlet
  {
    type freestream;
    freestreamValue $internalField;
  }
  outlet
  {
    type inletOutlet;
    inletValue uniform (0 0 0);
    value $internalField;
  }
  topbottom
  {
    type freestream;
    freestreamValue $internalField;
  }
  foil
  {
    type movingWallVelocity;
    value uniform (0 0 0); 	//fixedValue;
  }
  oversetPatch
  {
    type overset;
    value $internalField;
  }
  defaultFaces
  {
    type empty;
  }
} 	// ************************************************************************* //

