7111.0/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            freestreamPressure;
	freestreamValue	$internalField;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    topbottom
    {
        type            freestreamPressure;
	freestreamValue	$internalField;
    }
    foil
    {
        type            zeroGradient;
    }
    oversetPatch
    {
        type            overset;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
