7111.0/0/dissip_rate
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object dissip_rate;
}

dimensions [0 0 -1 0 0 0 0];

internalField uniform 3674.234614174767;

boundaryField
{
  inlet
  {
    type freestream;
    freestreamValue $internalField;
  }
  outlet
  {
    type inletOutlet;
    inletValue $internalField;
    value $internalField;
  }
  topbottom
  {
    type freestream;
    freestreamValue $internalField;
  }
  foil
  {
    type omegaWallFunction;
    value $internalField;
  }
  oversetPatch
  {
    type overset;
    value $internalField;
  }
  defaultFaces
  {
    type empty;
  }
} 	// ************************************************************************* //

