7111.0/0/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object nut;
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 0.0;

boundaryField
{
  inlet
  {
    type freestream;
    freestreamValue $internalField;
  }
  outlet
  {
    type calculated;
    value uniform 0;
  }
  topbottom
  {
    type freestream;
    freestreamValue $internalField;
  }
  foil
  {
    type nutkWallFunction;
    value uniform 0;
  }
  oversetPatch
  {
    type overset;
    value $internalField;
  }
  defaultFaces
  {
    type empty;
  }
} 	// ************************************************************************* //

