7111.0/0/turb_energy
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object turb_energy;
}

dimensions [0 2 -2 0 0 0 0];

internalField uniform 13.5;

boundaryField
{
  inlet
  {
    type freestream;
    freestreamValue $internalField;
  }
  outlet
  {
    type inletOutlet;
    inletValue $internalField;
    value $internalField;
  }
  topbottom
  {
    type freestream;
    freestreamValue $internalField;
  }
  foil
  {
    type kqRWallFunction;
    value $internalField;
  }
  oversetPatch
  {
    type overset;
    value $internalField;
  }
  defaultFaces
  {
    type empty;
  }
} 	// ************************************************************************* //

