7111.0/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object fvSolution;
}

solvers
{
  cellDisplacement
  {
    solver PCG;
    preconditioner DIC;
    tolerance 1e-06;
    relTol 0;
    maxIter 100;
  }
  p
  {
    solver PBiCGStab;
    preconditioner DILU;
    tolerance 1e-06;
    relTol 0;
  }
  pFinal
  {
    $p ;
  }
  pcorr
  {
    $p ;
    solver PCG;
    preconditioner DIC;
  }
  pcorrFinal
  {
    $pcorr ;
    relTol 0;
  } 	//    pcorr//    {//        solver          GAMG;//        tolerance       1e-3;//        relTol          1e-1;//        smoother        GaussSeidel;//        nPreSweeps      0;//        nPostSweeps     2;//        cacheAgglomeration true;//        nCellsInCoarsestLevel 10;//        agglomerator    faceAreaPair;//        mergeLevels     1;//        minIter		1;//    }//    "(p|Phi)"//    {//        $pcorr;//        tolerance       1e-4;//        relTol          1e-2;//    }//    pFinal//    {//        $p;//        tolerance       1e-5;//        relTol          1e-2;//    }
  "(U|k|omega|epsilon|nuTilda|yPsi)"
  {
    solver smoothSolver;
    smoother GaussSeidel;
    nSweeps 2;
    tolerance 1e-05;
    relTol 0.1;
  }
  "(U|k|omega|epsilon|nuTilda|yPsi)Final"
  {
    $U ;
    tolerance 1e-06;
    relTol 0;
  }
}

PIMPLE
{
  momentumPredictor no;
  correctPhi yes;
  nOuterCorrectors 2; 	// number of pimple iterations; 1 : PISO mode
  nCorrectors 2; 	// number of p outter GAMG iteration; 0 : only pcorr
  nNonOrthogonalCorrectors 2; 	// number of p and pcorr inner GAMG iteration
  ddtCorr no;
  pRefCell 0;
  pRefValue 0;
  residualControl
  {
    p
    {
      tolerance 0.001;
      relTol 0;
    }
    U
    {
      tolerance 0.0001;
      relTol 0;
    }
    "(k|omega|epsilon|nuTilda)"
    {
      tolerance 1e-05;
      relTol 0;
    }
  }
}

potentialFlow
{
  nNonOrthogonalCorrectors 10;
  pRefCell 0;
  pRefValue 0;
}

relaxationFactors
{
  fields
  {
    p 0.3;
  }
  equations
  {
    "(U|k|omega|epsilon|nuTilda)" 0.7;
  } 	/*	"(U|k|omega|epsilon|nuTilda)Final"	1.0;*/
}

cache
{
  grad(U) /* empty */ ;
} 	// ************************************************************************* //

