7111.0/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
//    {
//        name    c0;
//        type    cellSet;
//        action  new;
//        source  regionToCell;
//        sourceInfo
//        {
//            insidePoints ((0 1 0));
//        }
//    }

//    {
//        name    c1;
//        type    cellSet;
//        action  new;
//        source  cellToCell;
//        sourceInfo
//        {
//            set c0;
//        }
//    }

//    {
//        name    c1;
//        type    cellSet;
//        action  invert;
//    }
    {
        name    movingZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set region1;
        }
    }
);

// ************************************************************************* //
